# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions' # if you need beta versions

# Fonts
cask 'font-fira-code-nerd-font'

# Utilities
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup' # Backup and restore app settings
brew 'mas' # Mac App Store manager
brew 'nano' # Prefered editor
brew 'topgrade' # Upgrade everything
brew 'tree' # List directory structure
brew 'starship' # Shell
brew 'neofetch' # System info

# Development
brew 'php@8.1' # I use PHP 8.1 for development
brew 'composer'
brew 'imagemagick'
brew 'nvm' # Node version manager

# Apps
cask 'google-chrome'
cask 'opera-gx'

cask 'bitwarden' # Password manager
cask 'authy' # 2FA manager

cask 'docker' # I use containerized version of MySQL and Redis
cask 'phpstorm'
cask 'visual-studio-code'
cask 'fork' # Git client
cask 'ray' # Debugging tool
cask 'insomnia' # API client
cask 'sequel-ace' # MySQL client

cask 'fig'

# cask 'onedrive'  # This is included with microsoft-office
cask 'microsoft-office'

cask 'utm' # QEMU GUI

# Communication
cask 'slack'
cask 'telegram'
cask 'whatsapp'

# Menubar
cask 'keepingyouawake' # Prevents Mac from sleeping
cast 'istat-menus'
# missing hovrly

# Quicklook plugins
cask 'qlmarkdown'
cask 'quicklook-json'

